Repository: mkappus1/DatenmanagementMTHS24
Catalog: Woche 2/Skripte/TMX-EN-IT/tmx_teil_2.tmx
Source language: en
Languages: it

source: Cyclones
it: Cicloni

source: Compressors [compactors] for waste collection containers
it: Compressori [compattatori] per contenitori di raccolta di rifiuti

source: Compressors for supercharging internal combustion engines
it: Compressori per sovralimentazione di motori a combustione interna

source: Regulators [parts of machines]
it: Regolatori [parti di macchine]

source: Cranks [parts of machines]
it: Manovelle [parti di macchine]

source: Cutting tools being parts of machines
it: Utensili da taglio che sono parti di macchine

source: Sharpening wheels [parts of electric machines]
it: Mole per affilare [parti di macchine elettriche]

source: Semiconductor processing machines for the manufacture of semiconductor wafers
it: Macchine per la lavorazione di semiconduttori per la fabbricazione di wafer semiconduttori

source: Separating cylinders [parts of machines]
it: Cilindri di separazione [parti di macchine]

source: Separating machines
it: Macchine separatrici

source: Electrically operated brushes, being parts of machines
it: Spazzole elettricamente azionate, che sono parti di macchine

source: Riding lawn mowers
it: Trattorini tosaerba

source: Feeding apparatus for engine boilers
it: Alimentatori di caldaie di macchine

source: Printing machines [for textile]
it: Macchine per la stampa [per tessuti]

source: Robotic vacuum cleaners
it: Aspirapolvere robotizzati

source: Milking machines
it: Macchine per mungere

source: Lifting machines for transporting bulk materials
it: Macchine di sollevamento per il trasporto di materiali sfusi

source: Linear motors, other than for land vehicles
it: Motori lineari, non per veicoli terrestri

source: Cheese slicers [machines]
it: Affettaformaggio [macchine]

source: Chopping machines
it: Macchine tritatutto

source: Clutch levers, other than for land vehicles
it: Leve della frizione, non per veicoli terrestri

source: Cleaning machines for aviation engines
it: Pulitrici per motori per aviazione

source: Cutting tools [machine] made of sintered materials based on nitrides
it: Utensili da taglio [macchine] in materiali sinterizzati basati su nitruri

source: Cylinder heads made of castings of light metal alloys [parts of machines]
it: Testate del cilindro in fusioni di leghe di metalli leggeri [parti di macchine]

source: Carbon brushes for alternators
it: Spazzole di carbonio per alternatori

source: Propeller shafts
it: Alberi di eliche

source: Electric planers
it: Pialle elettriche

source: Crawler cranes
it: Gru cingolate

source: Grinding machines with spiral bevel gears
it: Rettificatrici con ingranaggi conici spiroidali

source: Emulsifying machines [for chemical processing]
it: Macchine per emulsionare [per trattamento chimico]

source: Moulding machines
it: Macchine per modanare

source: Machines and apparatus for cleaning, electric
it: Macchine e apparecchi pulitrici elettrici

source: Dishwashers
it: Lavastoviglie

source: Compressors as parts of machines, motors and engines
it: Compressori come parti di macchine e motori

source: Hedge cutters [machines]
it: Tagliasiepi [macchine]

source: Taps [parts of machines, engines or motors]
it: Rubinetti [parti di macchine o di motori]

source: Machines and apparatus for carpet shampooing, electric
it: Macchine elettriche per il lavaggio di tappeti e moquettes

source: Round bale choppers [machines]
it: Trinciatrici a rotoballa [macchine]

source: Rolling surfaces [parts of machines] for packages
it: Superfici di rotolamento [parti di macchine] per imballaggi

source: Rolling mill cylinders
it: Cilindri di laminatoi

source: Rotary actuators
it: Azionatori rotativi

source: Rotary air compressors
it: Compressori d'aria rotativi

source: Ploughs [tractor towed agricultural implements]
it: Aratri [strumenti agricoli trainati da trattori]

source: Water pumps for vehicles
it: Pompe dell'acqua per veicoli

source: Anti-swinging brakes for tongs
it: Freni anti-oscillazione per molle

source: Kitchen tools [electric utensils]
it: Utensili da cucina [attrezzi elettrici]

source: Wringing machines for laundry
it: Macchine per strizzare la biancheria

source: Machines for burnishing
it: Macchine per brunitura

source: Numerically positioned universal milling machines
it: Fresatrici universali a posizionamento numerico

source: Nut splitters [machines]
it: Spacca-dadi [macchine]

source: Hydro-pneumatic accumulators
it: Accumulatori idropneumatici

source: Ignition distributors for internal combustion engines
it: Distributori d'accensione per motori a combustione interna

source: Image transfer machines [printing]
it: Macchine per il trasferimento di immagini

source: Electric alternators for land vehicles
it: Alternatori elettrici per veicoli terrestri

source: Apparatus for aerating water
it: Apparecchi per gasare l'acqua

source: Vacuum pump installations
it: Impianti di pompe a vuoto

source: Industrial pneumatic tools
it: Attrezzi pneumatici industriali

source: Brakes for presses
it: Freni per presse

source: Electric sewing machines
it: Macchine da cucire elettriche

source: Electric vacuum cleaners for industrial use
it: Aspirapolvere elettrici per uso industriale

source: Sprayers (insecticide -) [hand-held tools, electric]
it: Vaporizzatori (per insetticida -) [utensili manuali, elettrici]

source: Sprayers [machines] for use in agriculture
it: Irroratori [macchine] da utilizzare in agricoltura

source: Machines for cutting paper
it: Macchine per tagliare la carta

source: Couplings for pneumatic apparatus
it: Accoppiamenti per apparecchi pneumatici

source: Vibrating machines
it: Macchine vibranti

source: Vibration motors
it: Motori a vibrazione

source: Horticultural implements [machines]
it: Strumenti per l'orticoltura [macchine]

source: Power-operated coffee grinders
it: Macinini per il caffè elettrici

source: Wringing machines incorporating rollers
it: Macchine da strizzatura comprendenti rulli

source: Ironing machines for textile articles
it: Stiratrici per articoli tessili

source: Step-up gears for vehicles [other than land vehicles]
it: Ingranaggi moltiplicatori per veicoli [non per veicoli terrestri]

source: Stop valves of metal [parts of machines]
it: Valvole di arresto in metallo [parti di macchine]

source: Tips for cutters [parts of machines]
it: Puntali per trinciatrici [parti di macchine]

source: Nippers [machines]
it: Tenaglie [macchine]

source: Automatic conveyor installations
it: Impianti trasportatori automatici

source: Pumps being parts of washing machines
it: Pompe che sono parti di macchine lavatrici

source: Piece holders for polishing machines
it: Porta-pezzi per lucidatrici

source: Printing machines for electronic duplicating processes
it: Macchine da stampa per procedimenti di duplicazione elettronici

source: Exhaust mufflers for watercraft
it: Marmitte di scarico per imbarcazioni

source: Extracting machines utilising solvents
it: Macchine di estrazione a solventi

source: Rocket propulsion engines for boats
it: Motori di propulsione a razzo per barche

source: Flame sprayers for burning vegetation
it: Lanciafiamme per bruciare la vegetazione

source: Draw machines
it: Tecnigrafi

source: Mobile stairs [motorised]
it: Scale mobili [motorizzate]

source: Mosaic-type heads for impact printing machines [other than for office use]
it: Teste stampanti a mosaico per macchine stampatrici ad aghi [non per ufficio]

source: Tapping centres [machines]
it: Maschiatori [macchine]

source: Packaging apparatus [machines]
it: Apparecchi per imballaggio [macchine]

source: Ultrasonic cleaning instruments for jewellery
it: Strumenti di pulizia a ultrasuoni per gioielleria

source: Ultrasonic welding machines
it: Saldatrici ad ultrasuoni

source: Cylinders for machines
it: Cilindri di macchine

source: Slide valves [parts of machines]
it: Valvole a cassetto [parti di macchine]

source: Machines for conveying solids
it: Macchine per il trasporto di solidi

source: Abrasive wheels for power-operated grinders
it: Ruote abrasive per smerigliatrici elettriche

source: Submersible pumps
it: Pompe sommergibili

source: Sprays [parts of machines], other than for medical use
it: Nebulizzatori [parti di macchine], non per uso medico

source: Squeegees [machines]
it: Tergivetri [macchine]

source: Quilting machines for use in the manufacture of upholstery
it: Trapuntatrici per la fabbricazione di imbottiture

source: Radiator welding machines (Electric -)
it: Saldatrici per radiatori (Elettriche -)

source: Rasps [machines]
it: Raspe [macchine]

source: Workpiece locators [machines]
it: Localizzatori dei pezzi [macchine]

source: Workpiece slide tables [parts of machines]
it: Piani di scorrimento pezzi [parti di macchine]

source: Screw pulley blocks [parts of machines]
it: Paranchi a taglia a vite [parti di macchine]

source: Screwdriver bits for machines
it: Punte di cacciaviti per macchine

source: Agricultural machine tools
it: Macchine utensili agricole

source: Hammering machines
it: Macchine martellatrici

source: Leather-working machines
it: Macchine per lavorare il cuoio

source: Turf removing ploughs
it: Aratri per scoticare

source: Power-operated garden hose reels
it: Bobine motorizzate per tubi da giardino

source: Air filters for automobile engines
it: Filtri dell'aria per motori d'automobili

source: Jets being parts of machines
it: Getti che sono parti di macchine

source: Electrical domestic machines for vacuuming
it: Elettrodomestici per la pulizia ad aspirazione

source: Refrigerant compressors for heating installations
it: Compressori refrigeranti per impianti di riscaldamento

source: Road marking vehicles [machines]
it: Veicoli traccialinee [macchine]

source: Submersible electric motors [other than for land vehicles]
it: Motori elettrici sommergibili [non per veicoli terrestri]

source: Electric hammers [hand-held]
it: Martelli elettrici [manuali]

source: Upholstery shampoo applicators (Electric -)
it: Applicatori di shampoo per tappezzerie (Elettrici -)

source: Vacuum cleaners for cars
it: Aspirapolvere per automobili

source: Numerically controlled drilling machines with co-ordinate tables
it: Trapanatrici a controllo numerico con tavoli a coordinate

source: Numerically controlled machine tools
it: Macchine utensili a controllo numerico

source: Bottle filling machines
it: Riempitrici per liquidi

source: Pumping apparatus [machines]
it: Apparecchi di pompaggio [macchine]

source: Stencil cutters [machines] other than for office use
it: Taglierini per realizzare stencil [macchine] non per ufficio

source: Printing machines for printing on packaging
it: Macchine per la stampa su imballaggi

source: Gear units for power transmissions, other than for land vehicles
it: Ingranaggi per trasmissioni di potenza, non per veicoli terrestri

source: Gear units, other than for land vehicles
it: Ingranaggi, non per veicoli terrestri

source: Mowing machines [electric]
it: Falciatrici [elettriche]

source: Mufflers [parts of machines]
it: Silenziatori [parti di macchine]

source: Rolling presses [machines]
it: Presse a rulli [macchine]

source: Rolling surfaces [machines] for packages
it: Superfici di rotolamento [macchine] per imballaggi

source: Discharge screws for compressed air [parts of machines]
it: Viti di scarico per aria compressa [parti di macchine]

source: Discharge screws for gaseous materials [parts of machines]
it: Viti di scarico per materie gassose [parti di macchine]

source: Gravity fed machines for mounting on sowing machines
it: Macchine ad alimentazione a gravità da montare su seminatrici

source: Industrial mixing machines
it: Impastatrici industriali

source: Articulated transmissions for watercraft
it: Trasmissioni articolate per imbarcazioni

source: Attrition machines for cleaning
it: Macchine ad attrito per pulire

source: Thrusters [marine propulsion apparatus]
it: Propulsori [apparecchi di propulsione marittima]

source: Minting presses [machines]
it: Presse per conio [macchine]

source: Mobile elevating work platforms
it: Piattaforme di lavoro mobili elevabili

source: Graders [machines or parts of machines]
it: Livellatrici [macchine o parti di macchine]

source: Rotary hydraulic motors [other than for land vehicles]
it: Motori idraulici di rotazione [non per veicoli terrestri]

source: Wax-polishing machines (Electric -) for industrial purposes manufacturing
it: Macchine per incerare (Elettriche -) per scopi di produzione industriale

source: Fastener machines for inserting fasteners into components
it: Macchine per l'inserimento di fastener all'interno di componenti

source: Churns
it: Zangole

source: Gas turbines
it: Turbine a gas

source: Patterning mechanisms [machines], other than for office use
it: Meccanismi di incisione [macchine], non per ufficio

source: Impregnating machines
it: Macchine per impregnazione

source: Rinsing machines
it: Lavabottiglie

source: Tambours for embroidery machines
it: Telai per macchine da ricamo

source: Keys for releasing borers [machine]
it: Chiavi per liberare alesatori [macchina]

source: Keys for securing bits [machine]
it: Chiavi per fissare trapani [macchina]

source: Knife blades for electric knives
it: Lame per coltelli elettrici

source: Camshafts for vehicle engines
it: Alberi a camme per motori di veicoli

source: Machines for cleaning carpets
it: Macchine per la pulizia di tappeti

source: Catalytic converters
it: Convertitori catalitici

source: Speed governors for machines, engines and motors
it: Regolatori di velocità di macchine e di motori

source: Thermal contact welding machines
it: Saldatrici a contatto termico

source: Thermic torches [machines]
it: Cannelli termici [macchine]

source: Can crushers [machines]
it: Schiaccia-lattine [macchine]

source: Wire-coiling machines
it: Bobinatrici per cavi

source: Pile drivers
it: Battipali

source: Laboratory robots
it: Robot da laboratorio

source: Machines for the handling of materials
it: Macchine per la manipolazione dei materiali

source: Machines for loading
it: Macchine da carico

source: Combs being parts of machines
it: Pettini che sono parti di macchine

source: Comminutors for solid materials
it: Polverizzatori per materiali solidi

source: Turbine shafts [parts of machines]
it: Alberi delle turbine [parti di macchine]

source: Lathes [machine tools]
it: Torni [macchine-utensili]

source: Turnip cutting machines
it: Macchine da taglio per rape

source: Refrigerant compressors for cooling installations
it: Compressori refrigeranti per impianti di raffreddamento

source: Food processors
it: Robot da cucina

source: Polycrystalline diamond cutters for ready cutting of workpieces [machines]
it: Tagliatori di diamante policristallino per il pronto taglio di pezzi da lavorare [macchine]

source: Portable electric power tools
it: Utensili elettrici portatili

source: Linking mechanisms [parts of machines]
it: Meccanismi di collegamento [parti di macchine]

source: Shovels, mechanical
it: Pale meccaniche

source: Injectors for engines
it: Iniettori per motori

source: Beaters, electric
it: Battitori elettrici

source: Frames being parts of hydraulic elevators
it: Telai che sono parti di elevatori idraulici

source: Pneumatic transporters
it: Trasportatori pneumatici

source: Cutting guides for use with electric machines
it: Guide da taglio da utilizzare con macchine elettriche

source: Cutting insert holders [parts of machines]
it: Portainserti di tranciatura [parti di macchine]

source: Cutting tools [machine] in the form of end mills
it: Utensili da taglio [macchine] sotto forma di frese a codolo

source: Side cutters [machines]
it: Frese laterali [macchine]

source: Chucks [parts of machines]
it: Mandrini [parti di macchine]

source: Expansion tanks [parts of machines]
it: Vasi di espansione [parti di macchine]

source: Fixed and mobile cranes
it: Gru mobili e fisse

source: Hand implements (Electric -) for use in barbecue cooking
it: Strumenti manuali (Elettrici -) per cottura a barbecue

source: Hand saws (Electrically operated -)
it: Seghe a mano (Azionate elettricamente -)

source: Adjustable screwdrivers (Electric -)
it: Cacciaviti regolabili (Elettrici -)

source: Aeration pumps for bodies of water
it: Pompe di aerazione per masse d'acqua

source: Rocket motor propulsion apparatus for water craft
it: Motori di propulsione a razzo per imbarcazioni

source: Wire cutters [machines]
it: Tagliafili [macchine]

source: Wire pulling grips [machines]
it: Calze di trazione cavi [macchine]

source: Salad drainers [machines]
it: Scolainsalata [macchine]

source: Orbital sanding machines
it: Smerigliatrici (Orbitali -)

source: Gas turbine engines for air vehicles
it: Motori a turbina a gas per veicoli aerei

source: Machine tools for sale in kit form
it: Macchine utensili da vendersi in kit

source: Machines for the assembly of semiconductor components
it: Macchine per l'assemblaggio di componenti semiconduttori

source: Staged and segmented conveyors
it: Trasportatori a stadi e a segmenti

source: Snow blowing vehicles
it: Veicoli spazzaneve

source: Pasta cutters [machines]
it: Tagliapasta [macchine]

source: Clamp connectors for piping [parts of machines]
it: Connettori con serraggio per tubi [parti di macchine]

source: Power transmission couplings [other than for land vehicles]
it: Giunti di trasmissione [non per veicoli terrestri]

source: Power transmission couplings for machines
it: Giunti di trasmissione per macchine

source: Power transmission couplings for water vehicles
it: Giunti di trasmissione per veicoli acquatici

source: Letterpresses [printing machines]
it: Copialettere [macchine da stampa]

source: Electric egg beaters
it: Sbattiuova elettrici

source: Machine wheels
it: Ruote di macchine

source: Shaft bearings [parts of machines]
it: Cuscinetti di alberi [parti di macchine]

source: Tree branch cutters (Electric -)
it: Cesoie per rami di alberi (Elettriche -)

source: Tree branch pruners [machines]
it: Potatori per rami d'alberi [macchine]

source: Cartridges for filtering machines
it: Cartucce per macchine per filtrare

source: Compressors for refrigerators
it: Compressori per frigoriferi

source: Elevating or lifting work platforms [including mobile]
it: Piattaforme di lavoro di sollevamento [anche mobili]

source: Concrete mixers [machines]
it: Impastatrici di calcestruzzo

source: High-pressure pumps for washing appliances and installations
it: Pompe ad alta pressione per il lavaggio di apparecchiature e impianti

source: Involute grinding machines
it: Rettificatrici a evolvente

source: Ploughs being agricultural machines
it: Aratri che sono macchine agricole

source: Sprockets for water vehicle gearing
it: Denti per ingranaggi di veicoli acquatici

source: Deburring tools [parts of machines]
it: Utensili di sbavatura [parti di macchine]

source: Diaphgram pumps
it: Pompe a diaframma

source: Bearing units for wheels
it: Unità di cuscinetti per ruote

source: Trueing machines
it: Rettificatrici

source: Curtain drawing devices, electrically operated
it: Dispositivi elettrici per manovrare le tende

source: Rotary to linear actuators
it: Attuatori da rotanti a lineari

source: Rotating centres [machines]
it: Contropunta girevole [macchine]

source: Screens for the printing of textile materials [parts of machines]
it: Schermi per la stampa di materiali tessili [parti di macchine]

source: Screw air compressors
it: Compressori d'aria a vite

source: Screw milling cutters [parts of machines]
it: Frese a vite [parti di macchine]

source: Unloading cranes
it: Gru di scarico

source: Hydraulic controls for machines, motors and engines
it: Comandi idraulici per macchine e motori

source: Machines and apparatus for wax-polishing, electric
it: Macchine e apparecchi per incerare elettriche

source: Milling machines and grinding machines for the treatment of ceramics and metal
it: Fresatrici e rettificatrici per il trattamento di ceramica e metallo

source: Blades for powered tools
it: Lame per utensili elettrici

source: Disc brakes for machines
it: Freni a disco per macchine

source: Drilling machines and parts therefor
it: Perforatrici e relative parti

source: Compressors for gases
it: Compressori per i gas

source: Condensate separators
it: Separatori di condensa

source: Cranks [parts of water vehicles]
it: Manovelle [parti di veicoli nautici]

source: Handling apparatus for loading and unloading
it: Apparecchi di manutenzione [carico e scarico]

source: Hammers [parts of machines]
it: Martelli [parti di macchine]

source: Pneumatic hammers
it: Martelli pneumatici

source: Gas operated power generators
it: Generatori elettrici a gas

source: High-voltage generators
it: Generatori di alta tensione

source: Power transmissions for machines
it: Trasmissioni di potenza per macchine

source: Press rollers [parts of machines]
it: Rulli di stampa [parti di macchine]

source: Separators for separating solids from liquids
it: Separatori per la separazione di solidi da liquidi

source: Electric driving motors for machines
it: Motrici elettriche per macchine

source: Cutting tools being power-operated
it: Utensili da taglio che sono meccanizzati

source: Engines for model vehicles
it: Motori per modellini

source: Exhaust manifold for engines
it: Collettori di scarico per motori

source: Boxes for matrices [printing]
it: Cassette per matrici [stampa]

source: Label making machines [other than for office use]
it: Macchine per la creazione di etichette [non per ufficio]

source: Cemented carbide tips [tools for machines]
it: Punte in carburi agglomerati [utensili per macchine]

source: Central vacuum cleaning apparatus
it: Apparecchi aspirapolvere centrali

source: Circle cutters for use with machines
it: Cesoie circolari da utilizzare con macchine

source: Transmission components (except for land vehicles)
it: Organi di trasmissione (eccetto quelli per veicoli terrestri)

source: Meat mincing machines [electric machines]
it: Macchine per tritare la carne [macchine elettriche]

source: Abrasive instruments [tools for machines]
it: Strumenti per abradere [utensili per macchine]

source: Washing machines incorporating drying facilities
it: Lavatrici con funzione di asciugatura

source: Metal loading ramps [machines]
it: Rampe di carico metalliche [macchine]

source: Metal welding machines [electric]
it: Saldatrici per metalli [elettriche]

source: Tube reamers [parts of machines]
it: Alesatori per tubi [parti di macchine]

source: Vegetable cutting machines
it: Macchine per tagliare le verdure

source: Transmission shafts for air vehicles
it: Alberi di trasmissione per veicoli aerei

source: Transmissions for air vehicles
it: Trasmissioni per veicoli aerei

source: Grinders [hand-held power driven]
it: Smerigliatrici [portatili a motore]

source: Shuttles [parts of machines]
it: Navette [parti di macchine]

source: Ball screws
it: Viti a sfera

source: Barrels for use with drilling rigs
it: Fusti per impianti di trivellazione

source: Hydraulic wrenches for use on drilling rigs
it: Chiavi idrauliche per torri di trivellazione

source: Hydraulically operated butterfly valves
it: Valvole a farfalla a funzionamento idraulico

source: Beaters being electric appliances
it: Battitrici che sono apparecchi elettrici

source: Driving devices for machines
it: Dispositivi di comando per macchine

source: Machines for the textile industry
it: Macchine per l'industria tessile

source: Rotary brushes for machines
it: Spazzole rotanti per macchine

source: Direct current motors
it: Motori a corrente continua

source: Heat exchangers [parts of machines]
it: Scambiatori di calore [parti di macchine]

source: Fertilizer distributors [tractor towed agricultural implements]
it: Concimatrici [strumenti agricoli trainati da trattori]

source: Hay rakes [tractor towed agricultural implements]
it: Rastrelli per fieno [strumenti agricoli trainati da trattori]
